InformationRegisters/СопоставлениеНоменклатурыОФД/СопоставлениеНоменклатурыОФД.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СопоставлениеНоменклатурыОФД</name>
  <resources>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </resources>
  <dimensions>
    <name>НоменклатураНаименование</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Штрихкод</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

InformationRegisters/СопоставлениеНоменклатурыОФД/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ПрограммныйИнтерфейс

Функция СопоставлениеНоменклатуры(ТаблицаНоменклатурыОФД) Экспорт
	ТаблицаРезультат = Новый ТаблицаЗначений;
	ТаблицаРезультат.Колонки.Добавить("Идентификатор", ТаблицаНоменклатурыОФД.Колонки.Идентификатор.ТипЗначения);
	ТаблицаРезультат.Колонки.Добавить("Номенклатура",  Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	
	Если ТаблицаНоменклатурыОФД.Количество() = 0 Тогда
		Возврат ТаблицаРезультат;
	КонецЕсли;

	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("ТаблицаНоменклатурыОФД", ТаблицаНоменклатурыОФД);
	ТекстыЗапросов = Новый Массив;
	ТекстыЗапросов.Добавить(
	"ВЫБРАТЬ
	|	НоменклатураЧеков.Идентификатор КАК Идентификатор,
	|	НоменклатураЧеков.Наименование КАК Наименование,
	|	НоменклатураЧеков.Штрихкод КАК Штрихкод
	|ПОМЕСТИТЬ ВТ_НоменклатураЧеков
	|ИЗ
	|	&ТаблицаНоменклатурыОФД КАК НоменклатураЧеков");
	ТекстыЗапросов.Добавить(ТекстЗапросаПоискПодходящего());
	ТекстыЗапросов.Добавить(
	"ВЫБРАТЬ
	|	ВТ_СопоставленнаяНоменклатура.ИдентификаторСтроки КАК Идентификатор,
	|	ВТ_СопоставленнаяНоменклатура.НоменклатураСсылка КАК Номенклатура
	|ИЗ
	|	ВТ_СопоставленнаяНоменклатура КАК ВТ_СопоставленнаяНоменклатура");
	
	Запрос.Текст = СтрСоединить(ТекстыЗапросов, ОбщегоНазначенияБПВызовСервера.ТекстРазделителяЗапросовПакета());
	
	ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(Запрос.Выполнить().Выгрузить(), ТаблицаРезультат);
	
	Возврат ТаблицаРезультат;
КонецФункции

// Текст запроса для поиска подходящей номенклатуры
// Номенклатура подбирается по приоритетам 
// - высший у совпадения по штрихкоду и наименованию
// - средний у только штрихкода (возможно переименовали позицию в ККТ)
// - низжий - только наименование (возможно изменился производитель)
Функция ТекстЗапросаПоискПодходящего() Экспорт
	Возврат 
	"ВЫБРАТЬ
	|	СопоставлениеНоменклатурыОФД.Номенклатура КАК НоменклатураСсылка,
	|	1 КАК Приоритет,
	|	ВТ_НоменклатураЧеков.Идентификатор КАК Идентификатор
	|ПОМЕСТИТЬ ВТ_СопоставлениеНоменклатуры
	|ИЗ
	|	ВТ_НоменклатураЧеков КАК ВТ_НоменклатураЧеков
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СопоставлениеНоменклатурыОФД КАК СопоставлениеНоменклатурыОФД
	|		ПО ВТ_НоменклатураЧеков.Наименование = СопоставлениеНоменклатурыОФД.НоменклатураНаименование
	|			И ВТ_НоменклатураЧеков.Штрихкод = СопоставлениеНоменклатурыОФД.Штрихкод
	|ГДЕ
	|	ВТ_НоменклатураЧеков.Штрихкод <> """"
	|	И НЕ СопоставлениеНоменклатурыОФД.Номенклатура ЕСТЬ NULL
	|	И СопоставлениеНоменклатурыОФД.Номенклатура.ВАрхиве = ЛОЖЬ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СопоставлениеНоменклатурыОФД.Номенклатура,
	|	2,
	|	ВТ_НоменклатураЧеков.Идентификатор
	|ИЗ
	|	ВТ_НоменклатураЧеков КАК ВТ_НоменклатураЧеков
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СопоставлениеНоменклатурыОФД КАК СопоставлениеНоменклатурыОФД
	|		ПО ВТ_НоменклатураЧеков.Штрихкод = СопоставлениеНоменклатурыОФД.Штрихкод
	|ГДЕ
	|	ВТ_НоменклатураЧеков.Штрихкод <> """"
	|	И НЕ СопоставлениеНоменклатурыОФД.Номенклатура ЕСТЬ NULL
	|	И СопоставлениеНоменклатурыОФД.Номенклатура.ВАрхиве = ЛОЖЬ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СопоставлениеНоменклатурыОФД.Номенклатура,
	|	3,
	|	ВТ_НоменклатураЧеков.Идентификатор
	|ИЗ
	|	ВТ_НоменклатураЧеков КАК ВТ_НоменклатураЧеков
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СопоставлениеНоменклатурыОФД КАК СопоставлениеНоменклатурыОФД
	|		ПО ВТ_НоменклатураЧеков.Наименование = СопоставлениеНоменклатурыОФД.НоменклатураНаименование
	|ГДЕ
	|	НЕ СопоставлениеНоменклатурыОФД.Номенклатура ЕСТЬ NULL
	|	И СопоставлениеНоменклатурыОФД.Номенклатура.ВАрхиве = ЛОЖЬ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_СопоставлениеНоменклатуры.Идентификатор КАК ИдентификаторСтроки,
	|	МАКСИМУМ(ВТ_СопоставлениеНоменклатуры.НоменклатураСсылка) КАК НоменклатураСсылка
	|ПОМЕСТИТЬ ВТ_СопоставленнаяНоменклатура
	|ИЗ
	|	ВТ_СопоставлениеНоменклатуры КАК ВТ_СопоставлениеНоменклатуры
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			ВТ_СопоставлениеНоменклатуры.Идентификатор КАК Идентификатор,
	|			МИНИМУМ(ВТ_СопоставлениеНоменклатуры.Приоритет) КАК Приоритет
	|		ИЗ
	|			ВТ_СопоставлениеНоменклатуры КАК ВТ_СопоставлениеНоменклатуры
	|		
	|		СГРУППИРОВАТЬ ПО
	|			ВТ_СопоставлениеНоменклатуры.Идентификатор) КАК ВТ_ПодходящаяНоменклатура
	|		ПО ВТ_СопоставлениеНоменклатуры.Идентификатор = ВТ_ПодходящаяНоменклатура.Идентификатор
	|			И ВТ_СопоставлениеНоменклатуры.Приоритет = ВТ_ПодходящаяНоменклатура.Приоритет
	|ГДЕ
	|	НЕ ВТ_ПодходящаяНоменклатура.Идентификатор ЕСТЬ NULL
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_СопоставлениеНоменклатуры.Идентификатор
	|
	|ИМЕЮЩИЕ
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВТ_СопоставлениеНоменклатуры.НоменклатураСсылка) = 1";
КонецФункции

#КонецОбласти

#КонецЕсли
